In [1]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

In [2]:
obj = Series(np.arange(5), index = ['a', 'b', 'c', 'd', 'e'])
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [3]:
obj2 = obj.drop('c')
obj2

a    0
b    1
d    3
e    4
dtype: int32

In [8]:
obj3 = obj.drop(['b', 'd'])
obj3

a    0
c    2
e    4
dtype: int32

In [12]:
df = DataFrame(np.arange(16).reshape(4,4), 
               index = ['Seoul', 'Busan', 'Daegu', 'Incheon'],
               columns = ['one', 'two', 'three', 'four'])
df

         one  two  three  four
Seoul      0    1      2     3
Busan      4    5      6     7
Daegu      8    9     10    11
Incheon   12   13     14    15

In [13]:
new_df = df.drop(['Seoul', 'Busan'])
new_df

         one  two  three  four
Daegu      8    9     10    11
Incheon   12   13     14    15

In [16]:
new_df = df.drop('three', axis = 1)
new_df

         one  two  four
Seoul      0    1     3
Busan      4    5     7
Daegu      8    9    11
Incheon   12   13    15

In [17]:
new_df = df.drop(['two', 'four'], axis = 1)
new_df

         one  three
Seoul      0      2
Busan      4      6
Daegu      8     10
Incheon   12     14